Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Modifying a copy of a string leaves the original unaffected.
ja: ある文字列のコピーを修正しても、元のものはそのままで影響を受けません。

source: Modifying and Comparing Strings
ja: 文字列の修正と比較

source: Most importantly, they can be overloaded, so a type that conforms to StringInterpolationProtocol can provide several different appendInterpolation methods with different behaviors.
ja: 最も重要なことには、それらはオーバーロードされることができます、それでStringInterpolationProtocolに準拠する型は、いくつかの異なるappendInterpolationメソッドを異なる挙動で提供できます。

source: Move the code from the setter into the new method.
ja: コードをそのセッターから新しいメソッドに移動してください。

source: Moves instances from initialized source memory into the uninitialized memory referenced by this pointer, leaving the source memory uninitialized and the memory referenced by this pointer initialized.
ja: いくらかのインスタンスを初期化されたソースメモリからこのポインタによって参照される未初期化メモリに移動します、残っている未初期化ソースメモリは未初期化で、このポインタによって参照されたメモリは初期化されます。

source: Multiline string literals are enclosed in three double quotation marks ("""), with each delimiter on its own line.
ja: 複数行文字列リテラルは、３つの二重引用符記号（"""）に囲まれ、各区切り子をそれの独自の行上に持ちます。

source: Multiplies two values and produces their product.
ja: ２つの値を乗算してそれらの積を生成します。

source: Multiplies two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を乗算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Multiplies two values and stores the result in the left-hand-side variable.
ja: ２つの値を乗算して、結果を左手側の変数に格納します。

source: Multiply
ja: 乗算

source: Multiply and assign
ja: 乗算して代入する

source: Multiply with overflow
ja: 乗算、オーバーフローとともに

source: Multiply with overflow and assign
ja: 乗算、オーバーフローと割り当てとともに

source: Must be non-zero.
ja: 非ゼロでなければなりません。

source: Named and Unnamed Combining Classes
ja: 名前付きおよび名無しの結合クラス

source: Navigate back to the watch face.
ja: ウォッチフェイスに戻ってください。

source: Never call finalize() on hasher.
ja: finalize()をhasher上で決して呼び出さないでください。

source: Never resuming leaves the task in a suspended state indefinitely, and leaks any associated resources.
ja: 再開することは、そのタスクを決して曖昧に中断状態のままにしておきません、そしていかなる関連したリソースも漏洩しません。

source: Next, the bytes referenced by destBytes are copied into byteArray, a new [UInt8] array, and then the remainder of someBytes is appended to byteArray:
ja: 次に、destBytesによって参照されるバイトはbyteArray、新しい[UInt8]配列へとコピーされます、そしてそれからsomeBytesの残りはbyteArrayに加えられます：

source: Nil coalescing
ja: nil合体

source: No matter which way you call printInt(atAddress:), Swift’s type safety guarantees that you can only pass a pointer to the type required by the function—in this case, a pointer to an Int.
ja: あなたがprintInt(atAddress:)を呼び出す方法は問題ではありません、Swiftの型安全は、あなたが関数によって要求される型へのポインタを渡すことだけが可能であるのを保証します — この場合、Intへのポインタ。

source: None
ja: なし

source: Not equal
ja: 等しくない

source: Not identical
ja: 同一でない

source: Notably, it does not contain the standard digits or Latin/Greek letter blocks; instead, it contains the mathematical Latin, Greek, and Arabic letters and numbers defined in the Supplemental Multilingual Plane.
ja: 特に、それは標準の桁またはラテン／ギリシャ文字ブロックを含みません；代わりに、それは補助多言語面で定義される数学用のラテン、ギリシャ、そしてアラビア文字と数字を含みます。

source: Note
ja: 注意

source: Note that an index into one view may not have an exact corresponding position in another view.
ja: あるビューに対するインデックスが別のビューにおいて正確に対応する位置を持たないかもしれないことに注意してください。

source: Note that it is unsafe to escape the pointer provided to body.
ja: bodyに提供されたポインタをエスケープすることは安全でないことに注意してください。

source: Note that this may not be as effective as creating the task with the “right” priority to in the first place.
ja: これがまず第一にタスクをそれに対する “正しい” 優先度で作成するのと同じくらい有効ではないかもしれないことに注意してください。

source: Note that this might not be as effective as creating the task with the correct priority, depending on the executor’s scheduling details.
ja: これはタスクを正しい優先度で作成するのと同じくらい効果的でないかもしれないことに注意してください、エグゼキュータのもつ予定の仕方の詳細に依存しています。

source: Note that unlike the scalar && operator, the SIMD .& operator always fully evaluates both arguments.
ja: スカラー&&演算子と違って、SIMD .& 演算子は常に両方の引数を完全に評価することに注意してください。

source: Note that unlike the scalar || operator, the SIMD .| operator always fully evaluates both arguments.
ja: スカラー||演算子と違って、SIMD .| 演算子は常に両方の引数を完全に評価することに注意してください。

source: Now that the shorterIndices array holds the indices of the shorter names in the names set, you can use those indices to access elements in the set.
ja: 現在、shorterIndices配列はnames集合の中のより短い名前のインデックスを保持します、あなたはそれらのインデックスを使ってこの集合の要素にアクセスできます。

source: Numbers and Basic Values
ja: 数と基本的な値

source: Numerals greater than 9 are represented as Roman letters.
ja: ９より大きい数詞はローマ字で表されます。

source: Numeric Protocols
ja: 数に関するプロトコル

source: Numeric Values
ja: 数値

source: Objective-C and C Code Customization
ja: Objective-CとCコードのカスタム化

source: Objective-C key paths are distinct from, but related to, key-path expressions in Swift.
ja: Objective-Cキーパスは、Swiftでのキーパス式とは違います、しかしそれと関連します。

source: Offsets the given index by the specified distance, or so that it equals the given limiting index.
ja: 与えられたインデックスをこの指定された隔たりで補います、またはそれでそれは与えられた限界インデックスと等しくなります。

source: Offsets the given index by the specified distance.
ja: 与えられたインデックスを指定された間隔で補います。

source: Often, the optimizer can eliminate bounds- and uniqueness-checks within an algorithm, but when that fails, invoking the same algorithm on body\ ’s argument lets you trade safety for speed.
ja: しばしば、最適化機能はアルゴリズム内部で境界および固有さ検査を省くことができます、しかしそれが失敗する時、同じアルゴリズムをbodyの引数上で発動することは、あなたに安全をスピードと交換させます。

source: Omits a specified number of elements from the base asynchronous sequence, then passes through all remaining elements.
ja: 指定された数の要素を基底非同期シーケンスから除きます、それから全ての残りの要素をずっと渡します。

source: Omits elements from the base asynchronous sequence until a given closure returns false, after which it passes through all remaining elements.
ja: 要素を基底非同期シーケンスから、ある与えられたクロージャがfalseを返すまで省きます、それの後それは全ての残りの要素をずっと渡します。

source: On 32-bit platforms, UInt is the same size as UInt32, and on 64-bit platforms, UInt is the same size as UInt64.
ja: 32ビットプラットホーム上では、UIntはUInt32と同じ大きさです、そして64ビットプラットホーム上では、UIntはUInt64と同じ大きさです。

source: On This Page
ja: この項には

source: On a big-endian platform, for any integer x, x == x.bigEndian.
ja: ビッグエンディアンプラットホーム上で、何らかの整数xに対して、x == x.bigEndian。

source: On a little-endian platform, for any integer x, x == x.littleEndian.
ja: リトルエンディアンプラットホーム上で、何らかの整数xに対して、x == x.littleEndian。

source: On the other hand, an emoji flag character is constructed from a pair of Unicode scalar values, like "\u{1F1F5}" and "\u{1F1F7}".
ja: 一方で、あるemoji国旗文字は一対のユニコードスカラー値から構築されます、"\u{1F1F5}"と"\u{1F1F7}"のように。

source: Once nil has been returned, all subsequent calls return nil.
ja: 一旦nilが返されるならば、すべての続いて起こる呼び出しはnilを返します。

source: Once all of the segments are appended, the interpolation is passed to an init(stringInterpolation:) initializer on the type being created, which must extract the accumulated data from the StringInterpolation.
ja: 一旦すべての文節が追加されるならば、補間はその作成されている型上でのinit(stringInterpolation:)イニシャライザに渡されます、それは蓄積されたデータをStringInterpolationから抽出しなければなりません。

source: Once the predicate returns false it will not be called again.
ja: いったん述部がfalseを返すならそれは再び呼び出されません。

source: Only APIs on UnsafeCurrentTask that are also part of Task are safe to invoke from another task besides the one that this task handle represents.
ja: UnsafeCurrentTask上のAPIそれらでまたTaskの一部でもあるものだけが、このタスクハンドルが表すものに加えてさらに別のタスクからの発動が安全です。

source: Only Swift function types with C function reference calling convention may be used for function pointer arguments.
ja: C関数参照呼出手法を持つスウィフト関数型だけが、関数ポインタ引数のために使われます。

source: Only code that’s running as part of the task can interact with that task, by invoking the appropriate context-sensitive static functions which operate on the current task.
ja: タスクの一部として動作しているコードだけが、そのタスクと相互作用できます、現在のタスク上で動作する適切な文脈依存の静的関数を発動することによって。

source: Only the String and Substring types in the standard library are valid conforming types.
ja: StringとSubstring型だけが標準ライブラリにおいて有効な準拠する型です。

source: Only use this method to rebind the buffer’s memory to a type with the same size and stride as the currently bound Element type.
ja: バッファのもつメモリを現在バインドされるElement型と同じサイズおよびストライドを持つある型に再バインドするためにだけこのメソッドを使ってください。

source: Only use this method to rebind the pointer’s memory to a type with the same size and stride as the currently bound Pointee type.
ja: ポインタのもつメモリを現在バインドされるPointee型と同じサイズおよびストライドを持つある型に再バインドするためにだけこのメソッドを使ってください。

source: Open Settings, and scroll down to Health > Health Data > Nutrition > Caffeine to see all of the drinks you added to the app.
ja: Settingsを開いて、そして Health > Health Data > Nutrition > Caffeine へと下にスクロールして、あなたがアプリに加えた飲み物の全てを見てください。

source: Operating on substrings is fast and efficient because a substring shares its storage with the original string.
ja: 下位文字列での演算は高速で効率的です、なぜなら下位文字列はそれのストレージを本来の文字列と共有するからです。

source: Operations are allowed to throw, in which case the try await next() invocation corresponding to the failed task will re-throw the given task.
ja: 演算はthrowを許可されます、その場合には失敗したタスクと結びつけられるtry await next()発動は、与えられたタスクを再スローするでしょう。

source: Operator
ja: 演算子

source: Operator Declarations
ja: 演算子宣言

source: Operator Functions
ja: 演算子関数

source: Optionals
ja: オプショナル

source: Other letters, including syllables and ideographs.
ja: 他の文字、音節と表意文字を含みます。

source: Other responses to cancellation include returning the work completed so far, returning an empty result, or returning nil.
ja: 取り消しへの他の応答は、これまでに完了した仕事を返す、空の結果を返す、またはnilを返すことを含みます。

source: Otherwise, iteration will stop if an ill-formed sequence is detected.
ja: そうでなければ、反復は誤形式シーケンスが検出されるならば停止します。

source: Otherwise, the memory must not be initialized or Pointee must be a trivial type.
ja: そうでなければ、メモリは初期化されてはなりません、またPointeeは自明型でなければなりません。

source: Overflow checking is not performed in -Ounchecked builds.
ja: オーバーフロー検査は、-Ouncheckedビルドでは実行されません。

source: Overview
ja: 概要

source: Parameters
ja: パラメータ

source: Parses a single Unicode scalar value from input.
ja: inputからの単一ユニコードスカラー値を構文解析します。

source: Parsing of the string is case insensitive.
ja: この文字列の構文解析は、大文字小文字に影響されません。

source: Pass true if you need the result to use only ASCII characters; otherwise, pass false.
ja: あなたが結果にASCII文字のみ使うことを必要とするならばtrue；そうでなければ、falseを渡してください。

source: Pass true to create a new string, even when the data referenced by cString contains ill-formed sequences.
ja: trueを渡すと、cStringによって参照されるデータが誤形式シーケンスを含む時であっても新しい文字列を作成します。

source: Pass true to measure the length of input even when input contains ill-formed sequences.
ja: trueを渡すと、inputが誤形式シーケンスを含む時であってもinputの長さを測ります。

source: Pass true to prevent the release of the string’s allocated storage.
ja: trueを渡して文字列のもつ割り当てストレージの解放を防止してください。

source: Pass true to request that the collection avoid releasing its storage.
ja: trueを渡して、コレクションがそのストレージを解放するのを回避するよう要求してください。

source: Pass true to use uppercase letters to represent numerals greater than 9, or false to use lowercase letters.
ja: trueを渡すことで大文字を使って９より大きい数詞を表します、またはfalseでは小文字を使います。

source: Pass false to immediately stop measuring input when an ill-formed sequence is encountered.
ja: falseを渡すと、誤形式シーケンスと出くわす場合にinputの計測を直ちに中止します。

source: Pass false to interrupt the creation of the new string if an ill-formed sequence is detected.
ja: falseを渡すと新しい文字列の作成は、誤形式シーケンスが検出されるならば中断します。

source: Pass a Constant Pointer as a Parameter
ja: 定数ポインタをパラメータとして渡す

source: Pass a Function Pointer as a Parameter
ja: 関数ポインタをパラメータとして渡す

source: Pass a Mutable Pointer as a Parameter
ja: 可変ポインタをパラメータとして渡す

source: Pass an Autoreleasing Pointer as a Parameter
ja: オートリリースポインタをパラメータとして渡す

source: Pass the greater-than operator (>) operator as the predicate.
ja: より大きい（>）演算子を述部として渡してください。

source: Passing a sequence with no elements or an empty collection as possiblePrefix always results in true.
ja: １つの要素もないシーケンスまたは空のコレクションをpossiblePrefixとして渡すことは、常にtrueという結果になります。

source: Passing a value that can’t be represented in this type results in a runtime error.
ja: この型において表せない値を渡すことは、実行時エラーという結果になります。

source: Passing the collection’s endIndex as the start parameter results in an empty subsequence.
ja: コレクションのendIndexをstartパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the collection’s starting index as the end parameter results in an empty subsequence.
ja: コレクションの開始インデックスをendパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the same index as both i and j has no effect.
ja: iとjの両方と同じアンデックスを渡すことは、効果を持ちません。

source: Pattern match
ja: パターン・マッチ

source: Perform asynchronous and parallel operations.
ja: 非同期なそして並列な演算それらを実行します。

source: Perform casts between types or represent values of any type.
ja: 型の間でキャストを実行したり、任意型の値を表します。

source: Performance Optimizations
ja: 性能最適化

source: Performing Typed Pointer Arithmetic
ja: 型付ポインタ算術を実行する

source: Performing a bitwise NOT operation on 0 returns a value with every bit set to 1.
ja: ビット単位のNOT演算を0に関して実行することは、すべてのビットが1に設定された値を返します。

source: Performs a traditional C-style assert with an optional message.
ja: 随意のメッセージを持つ伝統的なC形式アサートを実行します。

source: Performs an unbalanced autorelease of the object.
ja: オブジェクトのある不均衡なオートリリース（自動解放）を実行します。

source: Performs an unbalanced release of the object.
ja: オブジェクトのある不均衡なリリース（解放）を実行します。

source: Performs an unbalanced retain of the object.
ja: オブジェクトのある不均衡なリテイン（保持）を実行します。

source: Platform Implementation of SystemRandomNumberGenerator
ja: SystemRandomNumberGeneratorのプラットホーム実装

source: Pointer arithmetic with a typed pointer is counted in strides of the pointer’s Pointee type.
ja: 型付ポインタでのポインタ算術は、ポインタのもつPointee型のストライドで勘定されます。

source: Pointer arithmetic with raw pointers is performed at the byte level.
ja: 生のポインタを使うポインタ算術は、バイト水準で実行されます。

source: Pointers to Values
ja: 値へのポインタ

source: Pointwise bitwise AND
ja: ポイント単位ビット単位の積

source: Pointwise bitwise AND and assign
ja: ポイント単位ビット単位の積と代入

source: Pointwise bitwise OR
ja: ポイント単位ビット単位の和

source: Pointwise bitwise OR and assign
ja: ポイント単位ビット単位の和と代入

source: Pointwise bitwise XOR
ja: ポイント単位ビット単位の排他的和

source: Pointwise bitwise XOR and assign
ja: ポイント単位ビット単位の排他的和と代入

source: Pointwise equal
ja: ポイント関連同等

source: Pointwise greater than
ja: ポイント関連大なり

source: Pointwise greater than or equal
ja: ポイント関連大なり同等

source: Pointwise less than
ja: ポイント関連の小なり

source: Pointwise less than or equal
ja: ポイント関連小なり同等

source: Pointwise logical NOT
ja: ポイント単位論理否定

source: Pointwise not equal
ja: ポイント関連不等

source: Precondition: maximum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：maximumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: minimum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：minimumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: scalars must have the same number of elements as the vector type.
ja: 前提条件：scalarsは、ベクター型と同じ数の要素を持たなければなりません。

source: Precondition: v.value can be represented as ASCII (0..<128).
ja: 前提条件：v.valueがASCII（0..<128）として表現できること。

source: Precondition: May not be called after a previous self.encode(_:) call.
ja: 前提条件：前のself.encode(_:)呼び出しの後に呼び出されないこと。

source: Precondition: The next location exists.
ja: 前提条件：次の場所が存在すること。

source: Precondition: The next position is representable.
ja: 前提条件：次の位置が表現可能であること。

source: Precondition: The previous location exists.
ja: 前提条件：前の場所が存在すること。

source: Prefer this method over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or Dictionary.
ja: このメソッドを、効率のためにreduce(_:_:)より優先してください、その結果がコピーオンライト型である場合、例えばArrayまたはDictionaryに対しては。

source: Prepares the collection to store the specified number of elements, when doing so is appropriate for the underlying type.
ja: 指定された数の要素を格納するようにコレクションを準備します、そうすることが基礎をなす型に対して適切である場合には。

source: Print the result using the index found in step 2 on the original absences array.
ja: 手順２で見つけたインデックスをオリジナルabsences配列上で使って結果を出力してください。

source: Print values to the console, read from and write to text streams, and use command line arguments.
ja: 値をコンソールに出力し、テキストストリームから読み込みおよびそれへと書き出し、そしてコマンドライン引数を使います。

source: Printing and Displaying a Scalar
ja: スカラーをプリントおよび表示する

source: Printing and Dumping
ja: プリントとダンプ

source: Priority
ja: 優先度

source: Priority elevation
ja: 優先度上昇

source: Priority inheritance
ja: 優先度継承

source: Priority scheduling
ja: 優先度スケジュール

source: Produces a string containing the bytes in a given C array, interpreted according to a given encoding.
ja: 与えられた符号化によって解釈される、与えられたC配列の中のバイトを含んでいる文字列を生成します。

source: Produces a string created by copying the data from a given C array of UTF8-encoded bytes.
ja: UTF8符号化されたバイトからなる与えられたC配列からコピーするデータによって作成される文字列を生成します。

source: Produces an initialized String object that contains a given number of bytes from a given buffer of bytes interpreted in a given encoding, and optionally frees the buffer.
ja: 初期化されたStringオブジェクトを作成します、それは与えられた符号化での与えられたバイト解釈のバッファ由来の与えられた数のバイトを含んでいます、そして随意にそのバッファを解放します。

source: Programming Tasks
ja: プログラミング作業

source: Proper alignment ensures that the result of distance(to:) accurately measures the distance between the two pointers, counted in strides of Pointee.
ja: 適切なアライメントは、distance(to:)の結果が正確に２つのポインタの間の隔たりを、Pointeeのストライドで数えて、測ることを確実にします。

source: Properties of this scalar defined by the Unicode standard.
ja: ユニコード標準によって定義されるこのスカラーのプロパティ。

source: Property wrapper that defines a task-local value key.
ja: タスクローカルな値キーを定義するプロパティラッパー。

source: Protocols, such as Collection and Equatable, that describe common abstractions.
ja: プロトコル、たとえばCollectionそしてEquatableなど、それは共通の抽象化を記述します。

source: Protocols, such as CustomDebugStringConvertible and CustomReflectable, that you use to customize operations that are available to all types.
ja: プロトコル、たとえばCustomDebugStringConvertibleそしてCustomReflectableなど、あなたはそれを使って全ての型で利用可能である演算をカスタマイズします。

source: Protocols, such as OptionSet, that you use to provide implementations that would otherwise require boilerplate code.
ja: プロトコル、たとえばOptionSetなど、あなたはそれを使用してそうしなければ定型文コードを必要としただろう実装を提供します。

source: Provide a custom reflection for your types using these protocols.
ja: あつらえのリフレクションをあなたの型に対してこれらのプロトコルを使って提供します。

source: Put the Coffee Data Class on the Main Actor
ja: Coffee Data Classをメインアクター上に置く

source: Querying Runtime Values
ja: 実行時値の問い合わせ

source: Random Number Generators
ja: 無作為数生成子

source: Range
ja: 範囲

source: Range Expressions
ja: 範囲式

source: Ranges
ja: さまざまな範囲

source: Raw Pointer Arithmetic
ja: 生のポインタ算術

source: Raw Pointers
ja: 生のポインタ

source: Raw Representation
ja: 生の表現

source: Raw memory that has just been allocated is in an uninitialized, untyped state.
ja: アロケートされてすぐの生のメモリは、初期化されない、型付けされない状態にあります。

source: Raw, Uninitialized Memory
ja: 生の、初期化されないメモリ

source: Reading from and writing to memory through a raw buffer are untyped operations.
ja: ある生のバッファを通してメモリから読み込むそしてそれへ書き込むことは、型無し演算です。

source: Reading from memory through a raw buffer is an untyped operation.
ja: ある生のバッファを通してメモリから読み込むことは、型無し演算のひとつです。

source: Reading task local values is simple and looks the same as-if reading a normal static property:
ja: タスクローカル値の読み出しは簡単です、そして通常の静的プロパティを読み出す場合と同じに見えます：

source: Reading task-local values
ja: タスクローカル値を読み出す

source: Reference Counting
ja: 参照カウント

source: Reference Types
ja: 参照型

source: Related Documentation
ja: 関連文書

source: Related String Types
ja: 関連した文字列型

source: Relationships
ja: 関係

source: Remainder
ja: 剰余

source: Remainder and assign
ja: 剰余と代入

source: Removes all elements from the collection.
ja: 全ての要素をコレクションから削除します。

source: Removes all the elements that satisfy the given predicate.
ja: 与えられた述部を満たす要素すべてを除去します。

source: Removes and returns the character at the specified position.
ja: 指定された位置での文字を削除して返します。

source: Removes and returns the element at the specified position.
ja: 指定された位置での要素を削除して返します。

source: Removes and returns the first element of the collection.
ja: コレクションの最初の要素を削除して返します。

source: Removes and returns the last element of the collection.
ja: コレクションの最後の要素を削除して返します。

source: Removes the characters in the given range.
ja: 与えられた範囲の中の文字を削除します。

source: Removes the elements in the specified subrange from the collection.
ja: 指定された下位範囲の中の要素をコレクションから削除します。

source: Removes the given number of elements from the end of the collection.
ja: 与えられた数の要素をコレクションの終わりから削除します。

source: Removes the specified number of elements from the beginning of the collection.
ja: 指定された数の要素をコレクションの始まりから削除します。

source: Removes the specified number of elements from the end of the collection.
ja: 指定された数の要素をコレクションの終わりから削除します。

source: Removes the specified subrange of elements from the collection.
ja: いくらかの要素からなる指定された下位範囲をコレクションから削除します。

source: Removing Substrings
ja: 下位文字列の削除

source: Reordering a String's Characters
ja: 文字列の持つ文字を並び替えます

source: Reorders the elements of the collection such that all the elements that match the given predicate are after all the elements that don’t match.
ja: コレクションの要素を再配列します、例えば、与えられた述部にマッチする要素すべてが、合致しない要素すべての後になるなど。

source: Repeatedly calling this method returns, in order, all the elements of the underlying sequence.
ja: 繰り返しこのメソッドを呼び出すことは、基礎をなすシーケンスのすべての要素を、順番に返します。

source: Replace Delegates and Completion Handlers with Async Methods
ja: 委任と完了ハンドラをasyncメソッドで置き換える

source: Replaces a with the pointwise exclusive or of a and b.
ja: aをaとbのポイント単位排他的論理和で置き換えます。

source: Replaces a with the pointwise logical conjuction of a and b.
ja: aをaとbのポイント単位論理積で置き換えます。

source: Replaces a with the pointwise logical disjunction of a and b.
ja: aをaとbのポイント単位論理和で置き換えます。

source: Replaces elements of this vector with other in the lanes where mask is true.
ja: このベクターの要素を、maskがtrueであるところの、レーンの中のotherで置き換えます

source: Replaces elements of this vector with elements of other in the lanes where mask is true.
ja: このベクターの要素を、maskがtrueであるところの、レーンの中のotherの要素で置き換えます。

source: Replaces the elements within the specified bounds with the given Unicode scalar values.
ja: 指定された領域内の要素を与えられたユニコードスカラー値で置き換えます。

source: Replaces the given index with its predecessor.
ja: 与えられたインデックスをそれの前のものと取り替えます。

source: Replaces the given index with its successor.
ja: 与えられたインデックスをそれの後に続くものと取り替えます。

source: Replaces the memory referenced by this pointer with the values starting at the given pointer, leaving the source memory uninitialized.
ja: このポインタによって参照されるメモリを与えられたポインタで始まるいくらかの値と置き換えます、ソースメモリは未初期化のままです。

source: Replaces the specified subrange of elements with the given collection.
ja: いくらかの要素からなる指定された下位範囲を与えられたコレクションで置き換えます。

source: Replaces the text within the specified bounds with the given characters.
ja: 指定された領域内のテキストを与えられた幾らかの文字で置き換えます。

source: Replaces this pointer’s initialized memory with the specified number of instances from the given pointer’s memory.
ja: このポインタのもつ初期化されたメモリを、指定されたポインタのもつメモリからの指定された数のインスタンスで置き換えます。

source: Replaces this pointer’s memory with the specified number of consecutive copies of the given value.
ja: このポインタのもつメモリを、指定された数の指定された値の連続コピーで置き換えます。

source: Replaces this string with the empty string.
ja: この文字列を空の文字列で置き換えます。

source: Replacing Substrings
ja: 下位文字列の置換

source: Represents a string literal with interpolations while it is being built up.
ja: ある文字列リテラルでいくらかの補間をもつものを、それが作り上げられている間に表します。

source: Represents the contents of a string literal with interpolations while it’s being built up.
ja: いくらかの補間をもつある文字列リテラルの内容それらを、それが作り上げられている間に表します。

source: Required.
ja: 必須。

source: Reserves enough space in the string’s underlying storage to store the specified number of ASCII characters.
ja: 指定された数のASCII文字を格納するのに十分な空間を文字列のもつ基礎をなすストレージの中に確保します。

source: Reserves enough space in the view’s underlying storage to store the specified number of ASCII characters.
ja: 指定された数のASCII文字を格納するのに十分な空間をビューのもつ基礎をなすストレージの中に確保します。

source: Resources
ja: リソース

source: Resume the task awaiting next by having it return normally from its suspension point.
ja: 次を待っているタスクを、それをそれの一時停止地点から通常に復帰させることによって再開します。

source: Resume the task awaiting the continuation by having it either return normally or throw an error based on the state of the given Result value.
ja: 継続を待っているタスクを、それにそれの中断地点からこの与えられたResult値の状態に基づいて通常に復帰させるかエラーをスローさせるかどちらかによって再開します。
